MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
  ### Callback registration:
  - The compilation flag USE_HAL_IWDG_REGISTER_CALLBACKS allows dynamic configuration of the driver callbacks.
  - Use HAL_IWDG_RegisterEarlyWakeupCallback() function to register IWDG Early Wakeup callback.\n
  - This function takes as parameters the HAL peripheral handle and a pointer to the user callback function.
  */
/**
  * @}
  */

/** @defgroup IWDG_Configuration_Table IWDG Configuration Table
  * @{
  ## Configuration inside the IWDG driver:
 |Config defines                 |Where            |Default value          |Note                                       |
 |-------------------------------|-----------------|-----------------------|-------------------------------------------|
 |USE_HAL_IWDG_MODULE            |hal_conf.h       |           1           |Enable the HAL IWDG module.                |
 |USE_HAL_IWDG_REGISTER_CALLBACKS|hal_conf.h       |           0           |Enable register callback assertions.       |
 |USE_HAL_CHECK_PARAM            |hal_conf.h       |           0           |Enable checking of vital parameters at     |
 |                               |                 |                       |runtime                                    |
 |USE_HAL_IWDG_HARDWARE_START    |hal_conf.h       |           0           |IWDG driver starts in HW mode              |
 |USE_HAL_IWDG_USER_DATA         |hal_conf.h       |           0           |Add user data in the HAL IWDG handle       |
 |USE_HAL_IWDG_TIME_UNIT (*)     |hal_conf.h       | HAL_IWDG_TIME_UNIT_MS |Time unit to be used for IWDG driver       |
 |USE_HAL_IWDG_LSI_FREQ (**)     |hal_conf.h       |        LSI_VALUE      |LSI value to be applied to the IWDG driver |
 |USE_ASSERT_DBG_PARAM           |PreProcessor env |          NA           |Enable parameter assertions.               |
 |USE_ASSERT_DBG_STATE           |PreProcessor env |          NA           |Enable state assertions.                   |

(*) Select the value of the time unit with the USE_HAL_IWDG_TIME_UNIT define:

- HAL_IWDG_TIME_UNIT_US: IWDG driver time unit in microseconds.
- HAL_IWDG_TIME_UNIT_MS: IWDG driver time unit in milliseconds.
- HAL_IWDG_TIME_UNIT_S: IWDG driver time unit in seconds.<br>

The default time unit is milliseconds if not set by the user.\n\n

(**) Select the value of the LSI frequency with the USE_HAL_IWDG_LSI_FREQ define:
- LSI_VALUE_DYNAMIC: Dynamic LSI to be computed and set by the user.
- LSI_VALUE: LSI value of 32kHz.
The default LSI value is LSI_VALUE if not set by the user.\n
  ## Allowed maximum time ranges:
  The selection of prescaler is done as follows: as long as the requested reset time value is lower than the max_time
  of a time range n, the algorithm keeps the same prescaler n. Once it exceeds the max_time of the range n, the
  algorithm switches to the prescaler of the range n+1.
  The following table describes the possible maximum time ranges for each prescaler and with both standard values of
  the LSI frequency:\n
  Note:\n
  - For "Not supported" values in s, switch to the ms or us unit.
    Similarly, for "Not supported" values in us, switch to the ms or s unit.\n
  - To cover all ranges, time unit static configuration has been introduced and can be expressed in us, ms, or seconds.

  LSI(Hz) | Prescaler | Step(us) | Max(us)       | Max(ms) | Max(s)
  --------|-----------|----------|---------------|---------|-----------
  32000   | 4         | 125      | 512000        | 512     | Not supported
  32000   | 8         | 250      | 1024000       | 1024    | 1.024
  32000   | 16        | 500      | 2048000       | 2048    | 2.048
  32000   | 32        | 1000     | 4096000       | 4096    | 4.096
  32000   | 64        | 2000     | 8192000       | 8192    | 8.192
  32000   | 128       | 4000     | 16384000      | 16384   | 16.384
  32000   | 256       | 8000     | 32768000      | 32768   | 32.768
  32000   | 512       | 16000    | 65536000      | 65536   | 65.536
  32000   | 1024      | 32000    | 131072000     | 131072  | 131.072
  */
/**
  * @}
  */

#if (USE_HAL_IWDG_LSI_FREQ != LSI_VALUE) && (USE_HAL_IWDG_LSI_FREQ != LSI_VALUE_DYNAMIC)
#error "USE_HAL_IWDG_LSI_FREQ not correctly set"
#endif /* USE_HAL_IWDG_LSI_FREQ VERIFICATION */

#if (USE_HAL_IWDG_TIME_UNIT != HAL_IWDG_TIME_UNIT_US) && (USE_HAL_IWDG_TIME_UNIT != HAL_IWDG_TIME_UNIT_MS) \
     && (USE_HAL_IWDG_TIME_UNIT != HAL_IWDG_TIME_UNIT_S)
#error "USE_HAL_IWDG_TIME_UNIT not correctly set"
#endif /* USE_HAL_IWDG_TIME_UNIT VERIFICATION */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup IWDG_Private_Constants IWDG Private Constants
  * @{
  */
/**
  * Status register needs up to 5 LSI clock periods to be updated. However a synchronisation is added on prescaled LSI
  * clock rising edge, so we only consider a highest prescaler cycle.
  * The timeout value is calculated using the highest prescaler (1024) and the LSI_VALUE. The value of this constant can
  * be changed by the user to take into account possible LSI clock period variations.
  * The timeout value is multiplied by 1000 to be converted in milliseconds.
  * LSI startup time is also considered here by adding LSI_STARTUP_TIME converted in milliseconds.
  */
#define IWDG_DEFAULT_TIMEOUT  (((1UL * 1024UL * 1000UL) / LSI_VALUE) + \
                               ((LSI_STARTUP_TIME / 1000UL) + 1UL))  /*!< Default value of IWDG timeout */

#define IWDG_KERNEL_UPDATE_FLAGS  (IWDG_SR_EWU | IWDG_SR_WVU | \
                                   IWDG_SR_RVU | IWDG_SR_PVU)  /*!< Flags to be updated in the IWDG status register */
#define IWDG_WINDOW_DISABLE      IWDG_WINR_WIN   /*!< IWDG Window option disabled                       */
#define IWDG_MAX_STEP_NR         4096UL          /*!< IWDG Max step number                              */
#define IWDG_MAX_RELOAD          4095UL          /*!< IWDG Max reload                                   */
#define IWDG_TIME_CONVERSION     1000UL          /*!< Microseconds per millisecond                      */
#define IWDG_TIME_CONVERSION_US  1000000UL       /*!< Microseconds per second                           */
#define IWDG_MAX_TIME_PARAM      0xFFFFUL        /*!< Max time parameter                                */
#define IWDG_MAX_PRESCALER       1024UL          /*!< IWDG Max prescaler                                */

#define IWDG_MAX_TIME_32K_SEC    ((IWDG_MAX_PRESCALER * IWDG_MAX_STEP_NR) / LSI_VALUE)
/*!< Maximum time before reset at 32 kHz in seconds */
#define IWDG_MAX_TIME_32K_MSEC   ((IWDG_MAX_PRESCALER * IWDG_MAX_STEP_NR * IWDG_TIME_CONVERSION) / LSI_VALUE)
/*!< Maximum time before reset at 32 kHz in milliseconds */
#define IWDG_MAX_TIME_32K_USEC   (IWDG_MAX_TIME_32K_MSEC * IWDG_TIME_CONVERSION)
/*!< Maximum time before reset at 32 kHz in microseconds */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup IWDG_Private_Macros IWDG Private Macros
  * @{
  */

/*!< IWDG Macro to retrieve the IWDG instance */
#define IWDG_GET_INSTANCE(handle)  ((IWDG_TypeDef *)((uint32_t)(handle)->instance))

/*!< IWDG allowed max time for LSI = LSI_VALUE           */

