MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE)
#define IWDG_ALLOWED_MAX_TIME()  ((USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US) ? IWDG_MAX_TIME_32K_USEC : \
                                  ((USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_MS) ? IWDG_MAX_TIME_32K_MSEC : \
                                   IWDG_MAX_TIME_32K_SEC))
/*!< IWDG allowed max time for LSI set by user           */
#elif (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US)
#define IWDG_ALLOWED_MAX_TIME(lsi_freq)  (((IWDG_MAX_PRESCALER * IWDG_MAX_STEP_NR * IWDG_TIME_CONVERSION) / \
                                           lsi_freq) * IWDG_TIME_CONVERSION)
#elif (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_MS)
#define IWDG_ALLOWED_MAX_TIME(lsi_freq)  ((IWDG_MAX_PRESCALER * IWDG_MAX_STEP_NR * IWDG_TIME_CONVERSION) / \
                                          lsi_freq)
#elif (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_S)
#define IWDG_ALLOWED_MAX_TIME(lsi_freq)  ((IWDG_MAX_PRESCALER * IWDG_MAX_STEP_NR) / lsi_freq)
#endif /* USE_HAL_IWDG_TIME_UNIT */
#endif /* USE_HAL_IWDG_LSI_FREQ */

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
/**
  * @brief   Check IWDG max time value.
  * @param   max_time  IWDG max time value.
  * @if LSI_VALUE_DYNAMIC
  * @param   lsi_freq  IWDG LSI frequency value (only if LSI_VALUE_DYNAMIC is defined).
  * @endif
  * @warning max_time must not exceed IWDG_ALLOWED_MAX_TIME based on the LSI frequency and time unit values
  *          selected by the user.
  */
#define IS_IWDG_MAX_TIME(max_time, lsi_freq)  ((max_time) <= IWDG_ALLOWED_MAX_TIME(lsi_freq))
#else
/**
  * @brief   Check IWDG max time value.
  * @param   max_time  IWDG max time value.
  * @warning max_time must not exceed IWDG_ALLOWED_MAX_TIME based on the LSI frequency and time unit values
  *          selected by the user.
  */
#define IS_IWDG_MAX_TIME(max_time)            ((max_time) <= IWDG_ALLOWED_MAX_TIME())
#endif /* USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC */

/**
  * @brief Check IWDG min time value.
  * @param min_time  IWDG min time value
  * @param max_time  IWDG max time value
  */
#define IS_IWDG_MIN_TIME(min_time, max_time)  (((min_time) <= (max_time)) || ((min_time) == 0UL))

/**
  * @brief Check IWDG early wakeup time value.
  * @param ewi_time  IWDG early wakeup time value
  * @param max_time  IWDG max time value
  */
#define IS_IWDG_EWI_TIME(ewi_time, max_time)  (((ewi_time) < (max_time)) || ((ewi_time) == 0UL))
/**
  * @}
  */

/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup IWDG_Private_Functions IWDG Private Functions
  * @{
  */
static uint8_t  IWDG_CalculatePrescaler(const hal_iwdg_handle_t *hiwdg, uint32_t max_time);
static uint16_t IWDG_CalculateReload(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t max_time);
static uint16_t IWDG_CalculateParam(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t time);
static uint32_t IWDG_CalculateTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t param);
static void IWDG_ConfigureMinTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t min_time);
static void IWDG_ConfigureEarlyWakeupInterruptTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler,
                                                   uint32_t early_wakeup_time);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup IWDG_Exported_Functions
  * @{
  */

/** @addtogroup IWDG_Exported_Functions_Group1
  * @{

  This subsection provides a set of functions allowing to initialize and start the IWDG peripheral:
    - Call the function HAL_IWDG_Init() to initialize the IWDG handle and associate an instance.
    - Call the function HAL_IWDG_Start() to start the IWDG according to the parameters provided by the user.
  */

/**
  * @brief    Initialize the IWDG according to the associated handle.
  * @param    hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *           specified IWDG module.
  * @param    instance  IWDG instance.
  * @warning  LSI frequency used in the driver is reinitialized to the default value LSI_VALUE
  *           and then API HAL_IWDG_SetLSIFrequency() can be called to use a more accurate value.
  * @warning  In case of starting IWDG in Hardware mode, make sure that USE_HAL_IWDG_HARDWARE_START is aligned with
  *           the IWDG_SW option byte.
  * @retval   HAL_OK  Operation completed successfully.
  * @retval   HAL_INVALID_PARAM  Invalid parameter.
  */
hal_status_t HAL_IWDG_Init(hal_iwdg_handle_t *hiwdg, hal_iwdg_t instance)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_PARAM(IS_IWDG_ALL_INSTANCE((IWDG_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1UL)
  if (hiwdg == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hiwdg->instance = instance;

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  hiwdg->lsi_frequency_hz = LSI_VALUE;
#endif /* USE_HAL_IWDG_LSI_FREQ */

#if defined(USE_HAL_IWDG_REGISTER_CALLBACKS) && (USE_HAL_IWDG_REGISTER_CALLBACKS == 1UL)
  hiwdg->p_early_wakeup_cb = (hal_iwdg_cb_t)HAL_IWDG_EarlyWakeupCallback;
#endif /* USE_HAL_IWDG_REGISTER_CALLBACKS */

#if defined (USE_HAL_IWDG_USER_DATA) && (USE_HAL_IWDG_USER_DATA == 1UL)
  hiwdg->p_user_data = NULL;
#endif /* USE_HAL_IWDG_USER_DATA */

  if (LL_IWDG_IsActiveFlag_ONF(IWDG_GET_INSTANCE(hiwdg)) == 1UL)
  {
    hiwdg->global_state = HAL_IWDG_STATE_ACTIVE;
  }
  else
  {
#if defined(USE_HAL_IWDG_HARDWARE_START) && (USE_HAL_IWDG_HARDWARE_START == 1UL)
    return HAL_ERROR;
#else /* USE_HAL_IWDG_HARDWARE_START == 0UL */
    hiwdg->global_state = HAL_IWDG_STATE_IDLE;
#endif /* USE_HAL_IWDG_HARDWARE_START */
  }

  return HAL_OK;
}

/**
  * @brief   Start the IWDG. Before exiting the function, the watchdog is refreshed to have a correct time base.
  * @param   hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                 specified IWDG module.
  * @param   min_time Minimum time value before refreshing is allowed.
  * @param   max_time Maximum time value before an IWDG reset.
  * @param   early_wakeup_time Early Wakeup Interrupt time value.
  * @warning The min_time and max_time are used to define the window and the reload values, the unit for these
  *          parameters depend on the switch USE_HAL_IWDG_TIME_UNIT.
  * @warning When the Window is not needed, the value of min_time is set to 0U.
  * @warning The early_wakeup_time is used to set the Early Wakeup Interrupt. When it is not needed, value is
  *          set to 0U.
  * @retval  HAL_OK    Operation completed successfully.
  * @retval  HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_IWDG_Start(hal_iwdg_handle_t *hiwdg, uint32_t min_time, uint32_t max_time, uint32_t early_wakeup_time)
{
  uint32_t tickstart;
  uint8_t  prescaler;

  ASSERT_DBG_PARAM(hiwdg != NULL);

