MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  ASSERT_DBG_PARAM(IS_IWDG_MAX_TIME(max_time, hiwdg->lsi_frequency_hz));
#else
  ASSERT_DBG_PARAM(IS_IWDG_MAX_TIME(max_time));
#endif /* USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC */

  ASSERT_DBG_PARAM(IS_IWDG_MIN_TIME(min_time, max_time));
  ASSERT_DBG_PARAM(IS_IWDG_EWI_TIME(early_wakeup_time, max_time));

#if defined(USE_HAL_IWDG_HARDWARE_START) && (USE_HAL_IWDG_HARDWARE_START == 1UL)
  ASSERT_DBG_STATE(hiwdg->global_state, (uint32_t)HAL_IWDG_STATE_ACTIVE);
#else
  ASSERT_DBG_STATE(hiwdg->global_state, (uint32_t)HAL_IWDG_STATE_IDLE | (uint32_t)HAL_IWDG_STATE_ACTIVE);
  if (hiwdg->global_state == HAL_IWDG_STATE_IDLE)
  {
    HAL_CHECK_UPDATE_STATE(hiwdg, global_state, HAL_IWDG_STATE_IDLE, HAL_IWDG_STATE_ACTIVE);
  }
#endif /* USE_HAL_IWDG_HARDWARE_START */

  prescaler = IWDG_CalculatePrescaler(hiwdg, max_time);
  hiwdg-> reload = IWDG_CalculateReload(hiwdg, prescaler, max_time);

  LL_IWDG_Enable(IWDG_GET_INSTANCE(hiwdg));

  LL_IWDG_EnableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  LL_IWDG_SetPrescaler(IWDG_GET_INSTANCE(hiwdg), prescaler);
  LL_IWDG_SetReloadCounter(IWDG_GET_INSTANCE(hiwdg), hiwdg-> reload);

  /* Check Reload update flag, before performing any reload of the counter, else previous value will be taken. */
  tickstart = HAL_GetTick();

  while (LL_IWDG_IsActiveFlag_RVU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
  {
    /* Recheck the flags in case of interruption during timeout */
    if ((HAL_GetTick() - tickstart) > IWDG_DEFAULT_TIMEOUT)
    {
      if (LL_IWDG_IsActiveFlag_RVU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
      {
        LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

        return HAL_ERROR;
      }
    }
  }

  IWDG_ConfigureEarlyWakeupInterruptTime(hiwdg, prescaler, early_wakeup_time);

  IWDG_ConfigureMinTime(hiwdg, prescaler, min_time);

  /* Check pending flag, if previous update not done, return timeout */
  tickstart = HAL_GetTick();

  while ((LL_IWDG_READ_REG(IWDG_GET_INSTANCE(hiwdg), SR) & IWDG_KERNEL_UPDATE_FLAGS) != 0UL)
  {
    if ((HAL_GetTick() - tickstart) > IWDG_DEFAULT_TIMEOUT)
    {
      if ((LL_IWDG_READ_REG(IWDG_GET_INSTANCE(hiwdg), SR) & IWDG_KERNEL_UPDATE_FLAGS) != 0UL)
      {
        LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

        return HAL_ERROR;
      }
    }
  }

  LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup IWDG_Exported_Functions_Group2
  * @{

  This subsection provides a set of functions to manage the IWDG driver:
    - Call the function HAL_IWDG_Refresh() to reload IWDG counter with value defined in the reload register.
  */

/**
  * @brief  Refresh the IWDG.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_IWDG_Refresh(hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  LL_IWDG_ReloadCounter(IWDG_GET_INSTANCE(hiwdg));

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup IWDG_Exported_Functions_Group3
  * @{

  This subsection provides a set of functions to manage the IWDG driver:
    - Call the function HAL_IWDG_GetState() to retrieve the IWDG handle state.
  */

/**
  * @brief  Return the IWDG handle state.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @retval HAL_IWDG_STATE_RESET IWDG driver not initialized and not started.
  * @retval HAL_IWDG_STATE_IDLE IWDG driver initialized and not started.
  * @retval HAL_IWDG_STATE_ACTIVE IWDG driver initialized and started.
  */
hal_iwdg_state_t HAL_IWDG_GetState(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);

  return hiwdg->global_state;
}
/**
  * @}
  */

/** @addtogroup IWDG_Exported_Functions_Group4
  * @{

  This subsection provides a set of functions to set and retrieve configuration items separately for the IWDG driver:
    - Call the function HAL_IWDG_GetMaxTime() to retrieve the current reset time value.
    - Call the function HAL_IWDG_SetMinTime() to set only the Window time value.
    - Call the function HAL_IWDG_GetMinTime() to retrieve the current Window time value.
    - Call the function HAL_IWDG_SetEarlyWakeupInterruptTime() to set only the Early Wakeup time value.
    - Call the function HAL_IWDG_GetEarlyWakeupInterruptTime() to retrieve the current Early Wakeup time value.
    @note The prescaler is calculated from max_time once in the HAL_IWDG_Start() function. To avoid changing the
    prescaler, do not use a setMaxTime() function because it can modify the prescaler and therefore requires
    recalculating the Window and the Early Wakeup Interrupt.
    To modify max_time, call HAL_IWDG_Start().
  */

/**
  * @brief  Get the reset time value according to the handler instance registers.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @retval uint32_t  Current reset time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  */
uint32_t HAL_IWDG_GetMaxTime(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  return IWDG_CalculateTime(hiwdg, (uint8_t)LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg)), IWDG_MAX_TIME_PARAM);
}

/**
  * @brief  Get the step of the IWDG in microseconds.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @note   HAL_IWDG_GetStep_us is provided for information to allow calculation of max_time, min_time, and
  *         early_wakeup_time without rounding.
  * @retval uint32_t Current step value in us.
  */
uint32_t HAL_IWDG_GetStep_us(const hal_iwdg_handle_t *hiwdg)
{
  uint32_t step;
  uint32_t remainder;

  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);
#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  step = (IWDG_TIME_CONVERSION_US * (4UL * (1UL << LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg))))) /
         (hiwdg->lsi_frequency_hz);

  remainder = (IWDG_TIME_CONVERSION_US * (4UL * (1UL << LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg))))) %
              (hiwdg->lsi_frequency_hz);

