MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
  /* Round step to the closest integer value */
  if ((remainder > 0UL) && ((remainder * 2UL) >= (hiwdg->lsi_frequency_hz)))
#else
  step = (IWDG_TIME_CONVERSION_US * (4UL * (1UL << LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg))))) /
         (USE_HAL_IWDG_LSI_FREQ);

  remainder = (IWDG_TIME_CONVERSION_US * (4UL * (1UL << LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg))))) %
              (USE_HAL_IWDG_LSI_FREQ);

  if ((remainder > 0UL) && ((remainder * 2UL) >= (USE_HAL_IWDG_LSI_FREQ)))
#endif /* USE_HAL_IWDG_LSI_FREQ != LSI_VALUE_DYNAMIC */
  {
    step++;
  }

  return step;
}

/**
  * @brief  Set the Window time value.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @param  time   Window time value to be set.
  * @note   Modifying the IWDG Window register will automatically reload the watchdog counter.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR  Operation completed with error.
  */
hal_status_t HAL_IWDG_SetMinTime(hal_iwdg_handle_t *hiwdg, uint32_t time)
{
  uint32_t tickstart;
  uint8_t prescaler;

  ASSERT_DBG_PARAM(hiwdg != NULL);

  prescaler = (uint8_t)LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg));

  ASSERT_DBG_PARAM(IS_IWDG_MIN_TIME(time, IWDG_CalculateTime(hiwdg, prescaler, IWDG_MAX_TIME_PARAM)));
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  LL_IWDG_EnableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  IWDG_ConfigureMinTime(hiwdg, prescaler, time);

  tickstart = HAL_GetTick();

  while (LL_IWDG_IsActiveFlag_WVU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
  {
    /* Recheck the flags in case of interruption during timeout */
    if ((HAL_GetTick() - tickstart) > IWDG_DEFAULT_TIMEOUT)
    {
      if (LL_IWDG_IsActiveFlag_WVU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
      {
        LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

        return HAL_ERROR;
      }
    }
  }

  LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  return HAL_OK;
}

/**
  * @brief  Get the Early Wakeup time value according to the handler instance registers.
  * @param  hiwdg    Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                  specified IWDG module.
  * @retval uint32_t Current Window time value.
  */
uint32_t HAL_IWDG_GetMinTime(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  return IWDG_CalculateTime(hiwdg, (uint8_t)LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg)),
                            LL_IWDG_GetWindow(IWDG_GET_INSTANCE(hiwdg)));
}

/**
  * @brief  Set the Early Wakeup time value.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @param  time   Early Wakeup time value to be set.
  * @note   Modifying the IWDG early wakeup interrupt register will automatically reload the watchdog counter.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR  Operation completed with error.
  */
hal_status_t HAL_IWDG_SetEarlyWakeupInterruptTime(hal_iwdg_handle_t *hiwdg, uint32_t time)
{
  uint32_t tickstart;
  uint8_t prescaler;

  ASSERT_DBG_PARAM(hiwdg != NULL);

  prescaler = (uint8_t)LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg));

  ASSERT_DBG_PARAM(IS_IWDG_EWI_TIME(time, IWDG_CalculateTime(hiwdg, prescaler, IWDG_MAX_TIME_PARAM)));

  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  LL_IWDG_EnableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  IWDG_ConfigureEarlyWakeupInterruptTime(hiwdg, prescaler, time);

  tickstart = HAL_GetTick();

  while (LL_IWDG_IsActiveFlag_EWU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
  {
    if ((HAL_GetTick() - tickstart) > IWDG_DEFAULT_TIMEOUT)
    {
      /* Recheck the flag in case of interruption during timeout */
      if (LL_IWDG_IsActiveFlag_EWU(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
      {
        LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

        return HAL_ERROR;
      }
    }
  }

  LL_IWDG_DisableWriteAccess(IWDG_GET_INSTANCE(hiwdg));

  return HAL_OK;
}

/**
  * @brief  Get the Window time value according to the handler instance registers.
  * @param  hiwdg     Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                   specified IWDG module.
  * @retval uint32_t  Current Early Wakeup time value.
  */
uint32_t HAL_IWDG_GetEarlyWakeupInterruptTime(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  return IWDG_CalculateTime(hiwdg, (uint8_t)LL_IWDG_GetPrescaler(IWDG_GET_INSTANCE(hiwdg)),
                            LL_IWDG_GetEwiTime(IWDG_GET_INSTANCE(hiwdg)));
}

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
/**
  * @brief   Set the LSI frequency for the IWDG driver.
  * @param   hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                 specified IWDG module.
  * @param   lsi_frequency_hz  LSI frequency to be set.
  * @note    This function is available only if USE_HAL_IWDG_LSI_FREQ is set to dynamic (LSI_VALUE_DYNAMIC).
  * @warning Recompute all parameters after changing the LSI frequency. Call HAL_IWDG_Start().
  * @retval  HAL_OK Operation completed successfully.
  */
hal_status_t HAL_IWDG_SetLSIFrequency(hal_iwdg_handle_t *hiwdg, uint32_t lsi_frequency_hz)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
#if defined(USE_HAL_IWDG_HARDWARE_START) && (USE_HAL_IWDG_HARDWARE_START == 1UL)
  ASSERT_DBG_STATE(hiwdg->global_state, (uint32_t)HAL_IWDG_STATE_ACTIVE);
#else
  ASSERT_DBG_STATE(hiwdg->global_state, (uint32_t)HAL_IWDG_STATE_IDLE | (uint32_t)HAL_IWDG_STATE_ACTIVE);
#endif /* USE_HAL_IWDG_HARDWARE_START */

  hiwdg->lsi_frequency_hz = lsi_frequency_hz;

  return HAL_OK;
}

/**
  * @brief  Get the current LSI frequency.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @note   This function is available only if USE_HAL_IWDG_LSI_FREQ is set to dynamic (LSI_VALUE_DYNAMIC).
  * @retval uint32_t  Current computed LSI frequency value in Hz.
  */
uint32_t HAL_IWDG_GetLSIFrequency(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_STATE(hiwdg->global_state, HAL_IWDG_STATE_ACTIVE);

  return hiwdg->lsi_frequency_hz;
}
#endif /* USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC */
/**
  * @}
  */

/** @addtogroup IWDG_Exported_Functions_Group5
  * @{

