MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
  This subsection provides a set of functions to register the IWDG process and callbacks:

    - Use HAL_IWDG_IRQHandler() to handle IWDG interrupts.

  There are two ways to use callbacks:\n\n
  Override the weak callback function. Call HAL_IWDG_EarlyWakeupCallback() to indicate that an early interrupt is
  pending.\n
  Or register user callbacks. Call HAL_IWDG_RegisterEarlyWakeupCallback() to register the Early Wakeup Callback.
  */

/**
  * @brief  Handle IWDG interrupt request.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @note   The Early Wakeup Interrupt (EWI) can be used if specific safety operations or data logging must be
  *         performed before the actual reset is generated.
  *         Enable the EWI interrupt by calling HAL_IWDG_Start() with an early_wakeup_time.
  *         When the downcounter reaches the value EWIT - 1, an EWI interrupt is generated and the corresponding
  *         Interrupt Service Routine (ISR) can be used to trigger specific actions through the callback before the
  *         device resets.
  */
void HAL_IWDG_IRQHandler(hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);

  if (LL_IWDG_IsActiveFlag_EWIF(IWDG_GET_INSTANCE(hiwdg)) != 0UL)
  {
    LL_IWDG_ClearFlag_EWIF(IWDG_GET_INSTANCE(hiwdg));

#if defined(USE_HAL_IWDG_REGISTER_CALLBACKS) && (USE_HAL_IWDG_REGISTER_CALLBACKS == 1UL)
    hiwdg->p_early_wakeup_cb(hiwdg);
#else
    HAL_IWDG_EarlyWakeupCallback(hiwdg);
#endif /* USE_HAL_IWDG_REGISTER_CALLBACKS */
  }
}

/**
  * @brief   IWDG Early Wakeup callback.
  * @param   hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @warning This function must not be modified. When the callback is needed, implement
             HAL_IWDG_EarlyWakeupCallback() in the user file.
  */
__WEAK void HAL_IWDG_EarlyWakeupCallback(hal_iwdg_handle_t *hiwdg)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hiwdg);

}

#if defined(USE_HAL_IWDG_REGISTER_CALLBACKS) && (USE_HAL_IWDG_REGISTER_CALLBACKS == 1UL)
/**
  * @brief  Register the user IWDG Early Wakeup Callback.
  * @param  hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                specified IWDG module.
  * @param  p_callback pointer to the hal_iwdg_cb_t Callback function
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM  Invalid parameter.
  */
hal_status_t HAL_IWDG_RegisterEarlyWakeupCallback(hal_iwdg_handle_t *hiwdg, hal_iwdg_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1UL)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hiwdg->p_early_wakeup_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_IWDG_REGISTER_CALLBACKS */
/**
  * @}
  */

#if defined(USE_HAL_IWDG_USER_DATA) && (USE_HAL_IWDG_USER_DATA == 1UL)
/** @addtogroup IWDG_Exported_Functions_Group6
  * @{

  This section provides functions to set and get user data:
    - HAL_IWDG_SetUserData() stores user data in the IWDG handle.
    - HAL_IWDG_GetUserData() retrieves user data from the IWDG handle.
  */

/**
  * @brief Store the user data into the IWDG handle.
  * @param hiwdg       Pointer to IWDG handle.
  * @param p_user_data Pointer to the user data.
  */
void HAL_IWDG_SetUserData(hal_iwdg_handle_t *hiwdg, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);

  hiwdg->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the IWDG handle.
  * @param  hiwdg Pointer to IWDG handle.
  * @retval Pointer to the user data.
  */
const void *HAL_IWDG_GetUserData(const hal_iwdg_handle_t *hiwdg)
{
  ASSERT_DBG_PARAM(hiwdg != NULL);

  return (hiwdg->p_user_data);
}
/**
  * @}
  */

#endif /* USE_HAL_IWDG_USER_DATA */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup IWDG_Private_Functions
  * @{
  */

/**
  * @brief   Calculate the IWDG prescaler from the reset time set by the user.
  * @param   hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                 specified IWDG module.
  * @param   max_time Corresponding maximum time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  * @retval  0 for a prescaler = 4.
  * @retval  1 for a prescaler = 8.
  * @retval  2 for a prescaler = 16.
  * @retval  3 for a prescaler = 32.
  * @retval  4 for a prescaler = 64.
  * @retval  5 for a prescaler = 128.
  * @retval  6 for a prescaler = 256.
  * @retval  7 for a prescaler = 512.
  * @retval  [8..15] for a prescaler = 1024.
  */
static uint8_t IWDG_CalculatePrescaler(const hal_iwdg_handle_t *hiwdg, uint32_t max_time)
{
  uint32_t max_period = max_time;

#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US)
  max_period = max_period / IWDG_TIME_CONVERSION;
#elif (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_S)
  max_period = max_period * IWDG_TIME_CONVERSION;
#endif /* USE_HAL_IWDG_TIME_UNIT */

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  max_period = (max_period * hiwdg->lsi_frequency_hz / IWDG_TIME_CONVERSION) / (4UL * IWDG_MAX_STEP_NR);
#else
  STM32_UNUSED(hiwdg);
  max_period = (max_period * USE_HAL_IWDG_LSI_FREQ / IWDG_TIME_CONVERSION) / (4UL * IWDG_MAX_STEP_NR);
#endif /* USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC */

  return (uint8_t)(32UL - __CLZ((uint32_t)max_period));
}

/**
  * @brief   Calculate the IWDG reload parameter from the user-provided maximum time.
  * @param   hiwdg     Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                    specified IWDG module.
  * @param   prescaler IWDG prescaler.
  * @param   max_time  Corresponding maximum time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  * @retval  uint16_t  Current reload parameter.
  */
static uint16_t IWDG_CalculateReload(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t max_time)
{
  uint32_t reload = max_time;
  uint32_t lsi_frequency = USE_HAL_IWDG_LSI_FREQ;

#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_S)
  reload *= IWDG_TIME_CONVERSION;
#endif /* USE_HAL_IWDG_TIME_UNIT */

