MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_iwdg.c
#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  lsi_frequency = hiwdg->lsi_frequency_hz;
#else
  STM32_UNUSED(hiwdg);
#endif /* USE_HAL_IWDG_LSI_FREQ */

#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US)
  reload = (uint32_t)(((((uint64_t)reload * (uint64_t)lsi_frequency /
                         ((uint64_t)IWDG_TIME_CONVERSION * IWDG_TIME_CONVERSION * 2UL *
                          (uint64_t)((uint64_t)1UL << prescaler))) + 1UL) >> 1UL) - 1UL);
#else
  reload = ((reload * lsi_frequency /
             (IWDG_TIME_CONVERSION * 2UL * (1UL << prescaler)) + 1UL) >> 1UL) - 1UL;
#endif /* USE_HAL_IWDG_TIME_UNIT */

  return (uint16_t)(reload);
}

/**
  * @brief   Calculate the IWDG configuration parameters from the user-provided times.
  * @param   hiwdg      Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                     specified IWDG module.
  * @param   prescaler  IWDG prescaler.
  * @param   time       Corresponding maximum time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  * @note    By passing min_time as a parameter, it is converted to Window.
  * @note    By passing early_wakeup_time as a parameter, it is converted to early_wakeup_interrupt.
  * @retval  uint16_t   Converted parameter found.
  */
static uint16_t IWDG_CalculateParam(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t time)
{
  uint32_t param = time;
  uint32_t lsi_freq = USE_HAL_IWDG_LSI_FREQ;

#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_S)
  param = (param * IWDG_TIME_CONVERSION);
#endif /* USE_HAL_IWDG_TIME_UNIT */

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  lsi_freq = hiwdg->lsi_frequency_hz;
#endif /* USE_HAL_IWDG_LSI_FREQ */

#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US)
  param = hiwdg->reload - (uint32_t)((((((uint64_t)param * (uint64_t)lsi_freq) / \
                                        ((uint64_t)IWDG_TIME_CONVERSION * IWDG_TIME_CONVERSION * 2UL * \
                                         (uint64_t)((uint64_t)1UL << prescaler)))) + 1UL) >> 1UL);
#else
  param = hiwdg->reload - ((((param * lsi_freq) / (IWDG_TIME_CONVERSION * 2UL * (1UL << prescaler))) + 1UL) >> 1UL);
#endif /* USE_HAL_IWDG_TIME_UNIT */

  return (uint16_t)(param);
}

/**
  * @brief   Calculate  the timings from the according configuration parameters of the IWDG driver.
  * @param   hiwdg      Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                     specified IWDG module.
  * @param   prescaler  IWDG prescaler.
  * @param   param      Parameter corresponding to a timing.
  * @note    By passing Window as a parameter, it is converted to min_time.
  * @note    By passing early_wakeup_interrupt register value as a parameter, it will be converted to early_wakeup_time.
  * @note    By passing IWDG_MAX_TIME_PARAM as a parameter, it will be converted to max_time.
  * @retval  uint32_t   Converted time found in the selected USE_HAL_IWDG_TIME_UNIT unit.
  */
static uint32_t IWDG_CalculateTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t param)
{
  uint32_t returned_time;
  uint32_t remainder;
  uint32_t dividend;
  uint32_t divisor = USE_HAL_IWDG_LSI_FREQ;
  uint32_t reload_value = (hiwdg->reload - param);

  if (param == IWDG_MAX_RELOAD)
  {
    return 0U;
  }

  if (param == IWDG_MAX_TIME_PARAM)
  {
    reload_value = (hiwdg->reload + 1UL);
  }
  dividend = (reload_value * IWDG_TIME_CONVERSION * 4UL * (1UL << prescaler));

#if (USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC)
  divisor = hiwdg->lsi_frequency_hz;
#endif /* USE_HAL_IWDG_LSI_FREQ == LSI_VALUE_DYNAMIC */

  returned_time = dividend / divisor;
  remainder = dividend % divisor;

  if ((remainder * 2UL) >= divisor)
  {
    returned_time++;
  }

  /* Time conversion to selected unit */
#if (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_US)
  return (returned_time * IWDG_TIME_CONVERSION);
#elif (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_MS)
  return returned_time;
#elif (USE_HAL_IWDG_TIME_UNIT == HAL_IWDG_TIME_UNIT_S)
  uint32_t time_in_seconds = returned_time / IWDG_TIME_CONVERSION;
  if (((returned_time % IWDG_TIME_CONVERSION) * 2UL) >= IWDG_TIME_CONVERSION)
  {
    time_in_seconds++;
  }
  return time_in_seconds;
#endif /* USE_HAL_IWDG_TIME_UNIT */
}

/**
  * @brief   Configure the Window time value for the IWDG.
  * @param   hiwdg      Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *                     specified IWDG module.
  * @param   prescaler  Prescaler value.
  * @param   time       Minimum time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  */
static void IWDG_ConfigureMinTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler, uint32_t time)
{
  if (time != 0UL)
  {
    uint16_t window = IWDG_CalculateParam(hiwdg, prescaler, time);

    if (LL_IWDG_GetWindow(IWDG_GET_INSTANCE(hiwdg)) != (uint32_t)window)
    {
      /* Write to IWDG WINR the IWDG_Window value to compare with */
      /* In any case, even if Window feature is disabled, watchdog will be reloaded by writing windows register */
      LL_IWDG_SetWindow(IWDG_GET_INSTANCE(hiwdg), (uint32_t)window);
    }
    else
    {
      LL_IWDG_ReloadCounter(IWDG_GET_INSTANCE(hiwdg));
    }
  }
  else
  {
    /* Write to IWDG WINR the IWDG_Window value to compare with */
    /* In any case, even if Window feature is disabled, watchdog will be reloaded by writing windows register */
    LL_IWDG_SetWindow(IWDG_GET_INSTANCE(hiwdg), (uint16_t)IWDG_WINDOW_DISABLE);
  }
}
/**
  * @brief Configure the Early Wakeup Interrupt time for the IWDG.
  * @param hiwdg  Pointer to a hal_iwdg_handle_t structure that contains the configuration information for the
  *               specified IWDG module.
  * @param prescaler           Prescaler value.
  * @param early_wakeup_time   Early Wakeup Interrupt time in the selected USE_HAL_IWDG_TIME_UNIT unit.
  */
static void IWDG_ConfigureEarlyWakeupInterruptTime(const hal_iwdg_handle_t *hiwdg, uint8_t prescaler,
                                                   uint32_t early_wakeup_time)
{
  if (early_wakeup_time == 0UL)
  {
    LL_IWDG_DisableIT_EWI(IWDG_GET_INSTANCE(hiwdg));
  }
  else
  {
    uint16_t early_wakeup = IWDG_CalculateParam(hiwdg, prescaler, early_wakeup_time);

    LL_IWDG_ClearFlag_EWIF(IWDG_GET_INSTANCE(hiwdg));
    LL_IWDG_WRITE_REG(IWDG_GET_INSTANCE(hiwdg), EWCR, IWDG_EWCR_EWIE | early_wakeup);
  }
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_IWDG_MODULE */
#endif /* IWDG */
/**
  * @}
  */
